; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v13)
             (pred_9 ?v9 ?v12)
             (pred_6 ?v7 ?v12)
             (pred_7 ?v5 ?v7 )
	     (pred_10 ?v7)
             (pred_11 ?v2)
             (pred_4 ?v9)
             (pred_12 ?v12)
             (pred_1 ?v7)
             (pred_2 ?v9)
             (pred_3 ?v7)
             (pred_8 ))



(:action op_5
:parameters (?v8 ?v10 ?v1 ?v4)
:precondition (and (pred_11 ?v8) (pred_11 ?v10) (pred_4 ?v1) (pred_12 ?v4)
          (pred_5 ?v8 ?v10) (pred_9 ?v1 ?v4)
                   (pred_6 ?v10 ?v4) (pred_10 ?v8) 
                   (pred_1 ?v10) (pred_2 ?v1))
:effect (and  (pred_3 ?v10) (not (pred_1 ?v10))))


(:action op_2
:parameters (?v8 ?v6)
:precondition (and (pred_11 ?v8) (pred_11 ?v6)
               (pred_10 ?v8) (pred_5 ?v8 ?v6) (pred_3 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v8))))

(:action op_4
:parameters (?v8 ?v1)
:precondition (and (pred_11 ?v8) (pred_4 ?v1) 
                  (pred_10 ?v8) (pred_7 ?v1 ?v8) (pred_8 ))
:effect (and (pred_2 ?v1)
   (not (pred_7 ?v1 ?v8)) (not (pred_8 ))))


(:action op_1
:parameters (?v8 ?v3 ?v11)
:precondition (and (pred_11 ?v8) (pred_4 ?v3) (pred_4 ?v11)
                  (pred_10 ?v8) (pred_2 ?v11) (pred_7 ?v3 ?v8))
:effect (and (pred_2 ?v3) (pred_7 ?v11 ?v8)
        (not (pred_2 ?v11)) (not (pred_7 ?v3 ?v8))))

(:action op_3
:parameters (?v8 ?v1)
:precondition (and (pred_11 ?v8) (pred_4 ?v1) 
                  (pred_10 ?v8) (pred_2 ?v1))
:effect (and (pred_8 ) (pred_7 ?v1 ?v8) (not (pred_2 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_16 obj_06 obj_11 obj_08 obj_14 obj_12 obj_04 obj_20 obj_09 obj_19 obj_10 obj_01 obj_03 obj_05 obj_15
    obj_17 obj_13
    obj_18 obj_02
    )

    (:init
       (pred_8)

       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_11 obj_06)
       (pred_11 obj_11)
       (pred_11 obj_08)
       (pred_11 obj_14)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_02)

       (pred_5 obj_07 obj_08)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_12 obj_14)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_10)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_19)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_03 obj_05)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_03)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_6  obj_20 obj_17)
       (pred_6  obj_14 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_16)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_08)
       (pred_3 obj_12)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_3 obj_01)
       (pred_3 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_15)

       (pred_9  obj_18 obj_17)
       (pred_9  obj_02 obj_13)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_02 obj_01)
       (pred_10 obj_03)
    )

    (:goal (and
       (pred_7 obj_18 obj_15)
    ))
(:constraints
  (always (not (pred_10 obj_05)))
)
)

; plan
1. (op_2 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 0 of 1
2. (op_2 obj_09 obj_19)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_19)
   goals met: 0 of 1
3. (op_4 obj_19 obj_18)
   deleted: (pred_7 obj_18 obj_19) (pred_8)
   added: (pred_2 obj_18)
   goals met: 0 of 1
4. (op_2 obj_19 obj_10)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_15)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_15)
   goals met: 0 of 1
6. (op_3 obj_15 obj_18)
   deleted: (pred_2 obj_18)
   added: (pred_8) (pred_7 obj_18 obj_15)
   goals met: 1 of 1
